# Broadcasting Operations

In [1]:
import pandas as pd

In [3]:
nba["Age"].add(5).head(3)

0    30.0
1    30.0
2    32.0
Name: Age, dtype: float64

In [7]:
nba["Age"]+5

0      30.0
1      30.0
2      32.0
3      27.0
4      34.0
5      34.0
6      26.0
7      30.0
8      27.0
9      27.0
10     29.0
11     32.0
12     32.0
13     25.0
14     31.0
15     32.0
16     29.0
17     33.0
18     26.0
19     37.0
20     27.0
21     31.0
22     28.0
23     33.0
24     26.0
25     31.0
26     30.0
27     31.0
28     33.0
29     32.0
       ...
428    30.0
429    28.0
430    29.0
431    32.0
432    28.0
433    33.0
434    39.0
435    29.0
436    30.0
437    29.0
438    28.0
439    31.0
440    35.0
441    25.0
442    33.0
443    28.0
444    29.0
445    25.0
446    29.0
447    28.0
448    31.0
449    28.0
450    33.0
451    31.0
452    25.0
453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [16]:
nba["Salary"].sub(500).head(3)

0    7729837.0
1    6795617.0
2          NaN
Name: Salary, dtype: float64

In [2]:
nba=pd.read_csv("nba.csv")

In [14]:
nba["Salary"]-500

0       7729837.0
1       6795617.0
2             NaN
3       1148140.0
4       4999500.0
5      11999500.0
6       1170460.0
7       2164660.0
8       1823860.0
9       3430540.0
10      2568760.0
11      6912369.0
12      3425010.0
13      1749340.0
14      2616475.0
15      3425010.0
16       844559.0
17      1499500.0
18      1334980.0
19      6299500.0
20      1599340.0
21       133715.0
22      1499500.0
23     19688500.0
24      1139740.0
25       946776.0
26       980848.0
27       946776.0
28       946776.0
29     11235455.0
          ...
428     8042395.0
429      624593.0
430      946776.0
431     6980302.0
432     2893559.0
433     5999500.0
434     5015500.0
435     3075380.0
436     4235787.0
437     2524660.0
438      524593.0
439     1415020.0
440     2854440.0
441     2637220.0
442     4774500.0
443     2657740.0
444     9462984.0
445     3777220.0
446    11999500.0
447     1175380.0
448    15409070.0
449     1347940.0
450     2049500.0
451      980848.0
452     2239300.0
453     2432833.0
454      899500.0
455     2899500.0
456      946776.0
457           NaN
Name: Salary, Length: 458, dtype: float64

In [22]:
nba["Salary"].mul(0.5432).head(3)

0    4.199119e+06
1    3.691651e+06
2             NaN
Name: Salary, dtype: float64

In [23]:
nba["Weight in kilogram"]=nba["Weight"]*0.5432

In [24]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in kilogram
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,97.776
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,127.652
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,111.356

In [26]:
nba["Salary"].div(2).head(3)

0    3865168.5
1    3398058.5
2          NaN
Name: Salary, dtype: float64

In [27]:
nba["Salary in Million"]=nba["Salary"]/2

In [28]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in kilogram,Salary in Million
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,97.776,3865168.5
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,127.652,3398058.5
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,111.356,NaN